spec/cassettes/StripeSubscription/_create/creates_a_StripeSubscription.yml

---
http_interactions:
- request:
    method: post
    uri: https://api.stripe.com/v1/subscriptions
    body:
      encoding: UTF-8
      string: customer=cus_DHqGf2aCq0nWUt&items[0][plan]=restauranteur-development&trial_end=1534212935
    headers:
      User-Agent:
      - Stripe/v1 RubyBindings/3.17.0
      Authorization:
      - Bearer REDACTED
      Content-Type:
      - application/x-www-form-urlencoded
      X-Stripe-Client-User-Agent:
      - '{"bindings_version":"3.17.0","lang":"ruby","lang_version":"2.3.0 p0 (2015-12-25)","platform":"x86_64-darwin15","engine":"ruby","publisher":"stripe","uname":"Darwin
        Daniels-MacBook-Air.local 15.6.0 Darwin Kernel Version 15.6.0: Tue Jan 30
        11:45:51 PST 2018; root:xnu-3248.73.8~1/RELEASE_X86_64 x86_64","hostname":"Daniels-MacBook-Air.local"}'
      Accept-Encoding:
      - gzip;q=1.0,deflate;q=0.6,identity;q=0.3
      Accept:
      - "*/*"
  response:
    status:
      code: 200
      message: OK
    headers:
      Server:
      - nginx
      Date:
      - Tue, 24 Jul 2018 03:17:59 GMT
      Content-Type:
      - application/json
      Content-Length:
      - '2173'
      Connection:
      - keep-alive
      Access-Control-Allow-Credentials:
      - 'true'
      Access-Control-Allow-Methods:
      - GET, POST, HEAD, OPTIONS, DELETE
      Access-Control-Allow-Origin:
      - "*"
      Access-Control-Expose-Headers:
      - Request-Id, Stripe-Manage-Version, X-Stripe-External-Auth-Required, X-Stripe-Privileged-Session-Required
      Access-Control-Max-Age:
      - '300'
      Cache-Control:
      - no-cache, no-store
      Request-Id:
      - req_ER9WyV1RQsHm5o
      Stripe-Version:
      - '2018-05-21'
      Strict-Transport-Security:
      - max-age=31556926; includeSubDomains; preload
    body:
      encoding: UTF-8
      string: |
        {
          "id": "sub_DHqjLSQwqcaI6Q",
          "object": "subscription",
          "application_fee_percent": null,
          "billing": "charge_automatically",
          "billing_cycle_anchor": 1534212935,
          "cancel_at_period_end": false,
          "canceled_at": null,
          "created": 1532402279,
          "current_period_end": 1534212935,
          "current_period_start": 1532402279,
          "customer": "cus_DHqGf2aCq0nWUt",
          "days_until_due": null,
          "discount": null,
          "ended_at": null,
          "items": {
            "object": "list",
            "data": [
              {
                "id": "si_DHqjDgaLEi4s62",
                "object": "subscription_item",
                "created": 1532402279,
                "metadata": {},
                "plan": {
                  "id": "restauranteur-development",
                  "object": "plan",
                  "active": true,
                  "aggregate_usage": null,
                  "amount": 7900,
                  "billing_scheme": "per_unit",
                  "created": 1531797208,
                  "currency": "usd",
                  "interval": "month",
                  "interval_count": 1,
                  "livemode": false,
                  "metadata": {},
                  "nickname": "Restauranteur",
                  "product": "prod_DFE5sMkOQFQngD",
                  "tiers": null,
                  "tiers_mode": null,
                  "transform_usage": null,
                  "trial_period_days": 21,
                  "usage_type": "licensed"
                },
                "quantity": 1,
                "subscription": "sub_DHqjLSQwqcaI6Q"
              }
            ],
            "has_more": false,
            "total_count": 1,
            "url": "/v1/subscription_items?subscription=sub_DHqjLSQwqcaI6Q"
          },
          "livemode": false,
          "metadata": {},
          "plan": {
            "id": "restauranteur-development",
            "object": "plan",
            "active": true,
            "aggregate_usage": null,
            "amount": 7900,
            "billing_scheme": "per_unit",
            "created": 1531797208,
            "currency": "usd",
            "interval": "month",
            "interval_count": 1,
            "livemode": false,
            "metadata": {},
            "nickname": "Restauranteur",
            "product": "prod_DFE5sMkOQFQngD",
            "tiers": null,
            "tiers_mode": null,
            "transform_usage": null,
            "trial_period_days": 21,
            "usage_type": "licensed"
          },
          "quantity": 1,
          "start": 1532402279,
          "status": "trialing",
          "tax_percent": null,
          "trial_end": 1534212935,
          "trial_start": 1532402279
        }
    http_version:
  recorded_at: Tue, 24 Jul 2018 02:15:35 GMT
recorded_with: VCR 3.0.3
